---
kind: other
id: Properties.T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralH
source: html/e596dc0d-08cc-f5fb-0fb7-0745a31568f3.htm
---
# StructuralSectionGeneralH Properties

Common set of parameters for structural analysis.